
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.postgresql-user
* Replace
  * module.div-scheduler-db.azurerm_postgresql_active_directory_administrator.admin
  * module.div-scheduler-db.azurerm_resource_group.data-resourcegroup
  * module.div-scheduler-db.azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.postgresql-user will be updated in-place
  ~ resource "azurerm_key_vault_secret" "postgresql-user" {
        id                      = "https://div-aat.vault.azure.net/secrets/cos-postgresql-user/8c3b44bc0bf14ce38ead0fd8d929ea04"
        name                    = "cos-postgresql-user"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-scheduler-db.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "div-cos-postgres-v11-db-aat"
      + resource_group_name = "div-cos-postgres-v11-db-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.div-scheduler-db.azurerm_postgresql_active_directory_administrator.admin must be replaced
-/+ resource "azurerm_postgresql_active_directory_administrator" "admin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cos-data-aat/providers/Microsoft.DBforPostgreSQL/servers/div-cos-aat" -> (known after apply)
      ~ resource_group_name = "div-cos-data-aat" -> "div-cos-postgres-v11-db-data-aat" # forces replacement
      ~ server_name         = "div-cos-aat" -> "div-cos-postgres-v11-db-aat" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.div-scheduler-db.azurerm_resource_group.data-resourcegroup must be replaced
-/+ resource "azurerm_resource_group" "data-resourcegroup" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cos-data-aat" -> (known after apply)
      ~ name     = "div-cos-data-aat" -> "div-cos-postgres-v11-db-data-aat" # forces replacement
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-case-orchestration-service.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/div-case-orchestration-service.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.div-scheduler-db.azurerm_template_deployment.postgres-paas must be replaced
-/+ resource "azurerm_template_deployment" "postgres-paas" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cos-data-aat/providers/Microsoft.Resources/deployments/div-cos-aat" -> (known after apply)
      ~ name                = "div-cos-aat" -> "div-cos-postgres-v11-db-aat" # forces replacement
      ~ outputs             = {} -> (known after apply)
      ~ parameters          = {
          ~ "commonTags"                 = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LWNhc2Utb3JjaGVzdHJhdGlvbi1zZXJ2aWNlLmdpdCIsImFwcGxpY2F0aW9uIjoiZGl2b3JjZSIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjZGl2LWRldiIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IkRpdm9yY2UifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LWNhc2Utb3JjaGVzdHJhdGlvbi1zZXJ2aWNlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjZGl2LWRldiIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IkRpdm9yY2UifQ=="
          ~ "serverName"                 = "div-cos-aat" -> "div-cos-postgres-v11-db-aat"
          ~ "version"                    = "10" -> "11"
            # (15 unchanged elements hidden)
        }
      ~ resource_group_name = "div-cos-data-aat" -> "div-cos-postgres-v11-db-data-aat" # forces replacement
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1793,"Program":"tfcmt","SHA1":"","Vars":{}} -->